# ElementReferenceType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Reference..::..ElementReferenceType Property
Reference Class See Also
---
The type of reference.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementReferenceType ElementReferenceType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ElementReferenceType As ElementReferenceType
	Get
```

Visual C++
---
```text
public:
property ElementReferenceType ElementReferenceType {
	ElementReferenceType get ();
}
```

# See Also
Reference Class
Autodesk.Revit.DB Namespace